# Python

## Manipulação de dados
### DataFrames

O que veremos nesse tutorial?

1. leitura de dados
2. selecionar linhas
3. selecionar colunas
4. filtro de linhas
5. groupby com estatísticas
6. renomear colunas 
7. dados faltantes

## 1. Leitura dos dados

In [1]:
# importando biblioteca
import pandas as pd

In [2]:
# ler os dados
sp500 = pd.read_csv('data/sp500.csv')

### Mensurando tempo de exeução da leitura dos dados

In [6]:
%time pd.read_csv('data/sp500.csv')

CPU times: user 226 ms, sys: 15.4 ms, total: 242 ms
Wall time: 239 ms

       symbol        date      open      high       low     close    volume
0         AAL  2014-01-02   25.0700   25.8200   25.0600   25.3600   8998943
1        AAPL  2014-01-02   79.3828   79.5756   78.8601   79.0185  58791957
2         AAP  2014-01-02  110.3600  111.8800  109.2900  109.7400    542711
3        ABBV  2014-01-02   52.1200   52.3300   51.5200   51.9800   4569061
4         ABC  2014-01-02   70.1100   70.2300   69.4800   69.8900   1148391
...       ...         ...       ...       ...       ...       ...       ...
497467    XYL  2017-12-29   68.5300   68.8000   67.9200   68.2000   1046677
497468    YUM  2017-12-29   82.6400   82.7100   81.5900   81.6100   1347613
497469    ZBH  2017-12-29  121.7500  121.9500  120.6200  120.6700   1023624
497470   ZION  2017-12-29   51.2800   51.5500   50.8100   50.8300   1261916
497471    ZTS  2017-12-29   72.5500   72.7600   72.0400   72.0400   1704122

[497472 rows x 7 columns]

#### Mostrando as 10 primeiras linhas

In [9]:
sp500.head(10)

  symbol        date      open      high       low     close    volume
0    AAL  2014-01-02   25.0700   25.8200   25.0600   25.3600   8998943
1   AAPL  2014-01-02   79.3828   79.5756   78.8601   79.0185  58791957
2    AAP  2014-01-02  110.3600  111.8800  109.2900  109.7400    542711
3   ABBV  2014-01-02   52.1200   52.3300   51.5200   51.9800   4569061
4    ABC  2014-01-02   70.1100   70.2300   69.4800   69.8900   1148391
5    ABT  2014-01-02   38.0900   38.4000   38.0000   38.2300   4967472
6    ACN  2014-01-02   81.5000   81.9200   81.0900   81.1300   2405384
7   ADBE  2014-01-02   59.0600   59.5300   58.9400   59.2900   2746370
8    ADI  2014-01-02   49.5200   49.7500   49.0400   49.2800   2799092
9    ADM  2014-01-02   43.2200   43.2900   42.7900   42.9900   2753765

## 2. Selecionar linhas

In [71]:
## selecionando as linhas 1, 10 e 100
sp500.iloc[[1, 10, 100]]

    symbol        date      open      high       low     close    volume
1     AAPL  2014-01-02   79.3828   79.5756   78.8601   79.0185  58791957
10     ADP  2014-01-02   80.1700   80.4500   79.3800   79.8600   1965869
100    CMG  2014-01-02  530.0000  532.9599  521.5300  523.4300    456491

In [79]:
## removendo as linhas 1, 10 e 100
sp500.drop(index=[1, 10, 100])

# alternativa
excluir = [1, 10, 100]
sp500[~sp500.index.isin(excluir)]

       symbol        date    open    high     low   close   volume
0         AAL  2014-01-02   25.07   25.82   25.06   25.36  8998943
2         AAP  2014-01-02  110.36  111.88  109.29  109.74   542711
3        ABBV  2014-01-02   52.12   52.33   51.52   51.98  4569061
4         ABC  2014-01-02   70.11   70.23   69.48   69.89  1148391
5         ABT  2014-01-02   38.09   38.40   38.00   38.23  4967472
...       ...         ...     ...     ...     ...     ...      ...
497467    XYL  2017-12-29   68.53   68.80   67.92   68.20  1046677
497468    YUM  2017-12-29   82.64   82.71   81.59   81.61  1347613
497469    ZBH  2017-12-29  121.75  121.95  120.62  120.67  1023624
497470   ZION  2017-12-29   51.28   51.55   50.81   50.83  1261916
497471    ZTS  2017-12-29   72.55   72.76   72.04   72.04  1704122

[497469 rows x 7 columns]

## 3. Selecionar colunas

In [11]:
sp500.close
sp500['close']

# se vc quiser fazer uma cópia da coluna
sp500['close'].copy()

0          25.3600
1          79.0185
2         109.7400
3          51.9800
4          69.8900
            ...
497467     68.2000
497468     81.6100
497469    120.6700
497470     50.8300
497471     72.0400
Name: close, Length: 497472, dtype: float64

In [101]:
## mais de uma coluna
sp500[['symbol', 'close', 'volume']]

# alternativa mais veloz
sp500.loc[:,['symbol', 'close', 'volume']]

       symbol     close    volume
0         AAL   25.3600   8998943
1        AAPL   79.0185  58791957
2         AAP  109.7400    542711
3        ABBV   51.9800   4569061
4         ABC   69.8900   1148391
...       ...       ...       ...
497467    XYL   68.2000   1046677
497468    YUM   81.6100   1347613
497469    ZBH  120.6700   1023624
497470   ZION   50.8300   1261916
497471    ZTS   72.0400   1704122

[497472 rows x 3 columns]

In [99]:
## removendo colunas específicas
sp500.drop(columns=['high', 'open'])

       symbol        date       low     close    volume
0         AAL  2014-01-02   25.0600   25.3600   8998943
1        AAPL  2014-01-02   78.8601   79.0185  58791957
2         AAP  2014-01-02  109.2900  109.7400    542711
3        ABBV  2014-01-02   51.5200   51.9800   4569061
4         ABC  2014-01-02   69.4800   69.8900   1148391
...       ...         ...       ...       ...       ...
497467    XYL  2017-12-29   67.9200   68.2000   1046677
497468    YUM  2017-12-29   81.5900   81.6100   1347613
497469    ZBH  2017-12-29  120.6200  120.6700   1023624
497470   ZION  2017-12-29   50.8100   50.8300   1261916
497471    ZTS  2017-12-29   72.0400   72.0400   1704122

[497472 rows x 5 columns]

## 4. Selecionando linhas a partir de condições

In [120]:
sp500[sp500['volume'] < 1000]

       symbol        date   open   high    low    close  volume
182011    WRK  2015-06-26    NaN    NaN    NaN  61.9000     100
182501    WRK  2015-06-29  60.92  60.92  60.80  60.8000     300
249223    DHR  2016-01-12    NaN    NaN    NaN  88.5500       0
249438      O  2016-01-12    NaN    NaN    NaN  52.4300       0
278801     UA  2016-04-07    NaN    NaN    NaN  41.5600       0
308365    FTV  2016-07-01    NaN    NaN    NaN  49.5400       0
442107    BHF  2017-07-26    NaN    NaN    NaN  69.0842       3
443113    BHF  2017-07-28  67.26  67.26  67.26  67.2600     101

In [13]:
sp500.query('volume < 1000')

       symbol        date   open   high    low    close  volume
182011    WRK  2015-06-26    NaN    NaN    NaN  61.9000     100
182501    WRK  2015-06-29  60.92  60.92  60.80  60.8000     300
249223    DHR  2016-01-12    NaN    NaN    NaN  88.5500       0
249438      O  2016-01-12    NaN    NaN    NaN  52.4300       0
278801     UA  2016-04-07    NaN    NaN    NaN  41.5600       0
308365    FTV  2016-07-01    NaN    NaN    NaN  49.5400       0
442107    BHF  2017-07-26    NaN    NaN    NaN  69.0842       3
443113    BHF  2017-07-28  67.26  67.26  67.26  67.2600     101

In [18]:
sp500[(sp500.volume < 1000) & (sp500.close > 60)]

       symbol        date   open   high    low    close  volume
182011    WRK  2015-06-26    NaN    NaN    NaN  61.9000     100
182501    WRK  2015-06-29  60.92  60.92  60.80  60.8000     300
249223    DHR  2016-01-12    NaN    NaN    NaN  88.5500       0
442107    BHF  2017-07-26    NaN    NaN    NaN  69.0842       3
443113    BHF  2017-07-28  67.26  67.26  67.26  67.2600     101

In [19]:
sp500.query('volume < 1000 & close > 60')

       symbol        date   open   high    low    close  volume
182011    WRK  2015-06-26    NaN    NaN    NaN  61.9000     100
182501    WRK  2015-06-29  60.92  60.92  60.80  60.8000     300
249223    DHR  2016-01-12    NaN    NaN    NaN  88.5500       0
442107    BHF  2017-07-26    NaN    NaN    NaN  69.0842       3
443113    BHF  2017-07-28  67.26  67.26  67.26  67.2600     101

### Select

In [64]:
# selecionar as colunas que iniciam com v
colunas = sp500.columns\
[sp500.columns.str.startswith('v')].to_list()

sp500[colunas]

          volume
0        8998943
1       58791957
2         542711
3        4569061
4        1148391
...          ...
497467   1046677
497468   1347613
497469   1023624
497470   1261916
497471   1704122

[497472 rows x 1 columns]

In [66]:
# não vamos selecionar as colunas que iniciam com v
colunas = sp500.columns\
[~sp500.columns.str.startswith('v')].to_list()

sp500[colunas]

       symbol        date      open      high       low     close
0         AAL  2014-01-02   25.0700   25.8200   25.0600   25.3600
1        AAPL  2014-01-02   79.3828   79.5756   78.8601   79.0185
2         AAP  2014-01-02  110.3600  111.8800  109.2900  109.7400
3        ABBV  2014-01-02   52.1200   52.3300   51.5200   51.9800
4         ABC  2014-01-02   70.1100   70.2300   69.4800   69.8900
...       ...         ...       ...       ...       ...       ...
497467    XYL  2017-12-29   68.5300   68.8000   67.9200   68.2000
497468    YUM  2017-12-29   82.6400   82.7100   81.5900   81.6100
497469    ZBH  2017-12-29  121.7500  121.9500  120.6200  120.6700
497470   ZION  2017-12-29   51.2800   51.5500   50.8100   50.8300
497471    ZTS  2017-12-29   72.5500   72.7600   72.0400   72.0400

[497472 rows x 6 columns]

In [69]:
# mais de uma condição
colunas = sp500.columns\
[sp500.columns.str.startswith('v') | sp500.columns\
.str.startswith('c')].to_list()

sp500[colunas]

           close    volume
0        25.3600   8998943
1        79.0185  58791957
2       109.7400    542711
3        51.9800   4569061
4        69.8900   1148391
...          ...       ...
497467   68.2000   1046677
497468   81.6100   1347613
497469  120.6700   1023624
497470   50.8300   1261916
497471   72.0400   1704122

[497472 rows x 2 columns]

## 5. Groupby

#### Calculando estatísticas

In [105]:
## descrevendo as estatísticas básicas
sp500.describe()

,open,high,low,close,volume
count,497461.000000,497464.000000,497464.000000,497472.000000,4.974720e+05
mean,86.352275,87.132562,85.552467,86.369082,4.253611e+06
std,101.471228,102.312062,100.570957,101.472407,8.232139e+06
min,1.620000,1.690000,1.500000,1.590000,0.000000e+00
25%,41.690000,42.090000,41.280000,41.703750,1.080166e+06
50%,64.970000,65.560000,64.353700,64.980000,2.084896e+06
75%,98.410000,99.230000,97.580000,98.420000,4.271928e+06
max,2044.000000,2067.990000,2035.110000,2049.000000,6.182376e+08

In [4]:
sp500.describe().loc[['mean', 'std']]

            open        high         low       close        volume
mean   86.352275   87.132562   85.552467   86.369082  4.253611e+06
std   101.471228  102.312062  100.570957  101.472407  8.232139e+06

In [7]:
# vamos fazer o grupo por symbol e calcular a média do volume
sp500.groupby('symbol')['volume'].agg('mean')

symbol
A       2.191932e+06
AAL     9.751521e+06
AAP     1.137307e+06
AAPL    4.516957e+07
ABBV    8.408836e+06
            ...
XYL     1.159214e+06
YUM     3.225016e+06
ZBH     1.349760e+06
ZION    2.758079e+06
ZTS     3.485038e+06
Name: volume, Length: 505, dtype: float64

In [10]:
# ordenando de forma crescente
sp500.groupby('symbol')['volume'].agg('mean')\
.sort_values()

# ordenando de forma decrescente
sp500.groupby('symbol')['volume'].agg('mean')\
.sort_values(ascending=False)

symbol
BAC     8.936290e+07
AAPL    4.516957e+07
GE      4.144394e+07
AMD     3.328951e+07
F       3.291430e+07
            ...
ESS     4.031997e+05
RE      3.382805e+05
HII     3.331406e+05
AZO     3.211770e+05
MTD     1.719199e+05
Name: volume, Length: 505, dtype: float64

In [14]:
sp500_g = sp500.groupby('symbol')
estatisticas = sp500_g['close'].agg(['mean', 'std'])

estatisticas

              mean        std
symbol
A        49.097726   9.375208
AAL      42.424900   6.063245
AAP     143.187120  24.610670
AAPL    116.839892  24.547273
ABBV     63.338302  10.497342
...            ...        ...
XYL      43.515228   9.704832
YUM      76.402214   7.707074
ZBH     110.586902  10.403532
ZION     32.674543   7.515071
ZTS      47.268280  10.527773

[505 rows x 2 columns]

## 6. Renomeando colunas

In [15]:
# resetar index 
# estatisticas.reset_index(inplace=True)
estatisticas.rename(columns={'symbol':'ticker',
                             'mean':'media',
                             'std':'desvio'})

             media     desvio
symbol
A        49.097726   9.375208
AAL      42.424900   6.063245
AAP     143.187120  24.610670
AAPL    116.839892  24.547273
ABBV     63.338302  10.497342
...            ...        ...
XYL      43.515228   9.704832
YUM      76.402214   7.707074
ZBH     110.586902  10.403532
ZION     32.674543   7.515071
ZTS      47.268280  10.527773

[505 rows x 2 columns]

## 7. Dados faltantes

In [7]:
# somar a quantidade de dados faltantes para cada coluna
sp500.isnull().sum()

symbol     0
date       0
open      11
high       8
low        8
close      0
volume     0
dtype: int64

In [8]:
# drop NaN
sp500.dropna()

       symbol        date      open      high       low     close    volume
0         AAL  2014-01-02   25.0700   25.8200   25.0600   25.3600   8998943
1        AAPL  2014-01-02   79.3828   79.5756   78.8601   79.0185  58791957
2         AAP  2014-01-02  110.3600  111.8800  109.2900  109.7400    542711
3        ABBV  2014-01-02   52.1200   52.3300   51.5200   51.9800   4569061
4         ABC  2014-01-02   70.1100   70.2300   69.4800   69.8900   1148391
...       ...         ...       ...       ...       ...       ...       ...
497467    XYL  2017-12-29   68.5300   68.8000   67.9200   68.2000   1046677
497468    YUM  2017-12-29   82.6400   82.7100   81.5900   81.6100   1347613
497469    ZBH  2017-12-29  121.7500  121.9500  120.6200  120.6700   1023624
497470   ZION  2017-12-29   51.2800   51.5500   50.8100   50.8300   1261916
497471    ZTS  2017-12-29   72.5500   72.7600   72.0400   72.0400   1704122

[497461 rows x 7 columns]

In [23]:
# dropando NaN apenas em high
sp500.dropna(subset=['high'])

       symbol        date      open      high       low     close    volume
0         AAL  2014-01-02   25.0700   25.8200   25.0600   25.3600   8998943
1        AAPL  2014-01-02   79.3828   79.5756   78.8601   79.0185  58791957
2         AAP  2014-01-02  110.3600  111.8800  109.2900  109.7400    542711
3        ABBV  2014-01-02   52.1200   52.3300   51.5200   51.9800   4569061
4         ABC  2014-01-02   70.1100   70.2300   69.4800   69.8900   1148391
...       ...         ...       ...       ...       ...       ...       ...
497467    XYL  2017-12-29   68.5300   68.8000   67.9200   68.2000   1046677
497468    YUM  2017-12-29   82.6400   82.7100   81.5900   81.6100   1347613
497469    ZBH  2017-12-29  121.7500  121.9500  120.6200  120.6700   1023624
497470   ZION  2017-12-29   51.2800   51.5500   50.8100   50.8300   1261916
497471    ZTS  2017-12-29   72.5500   72.7600   72.0400   72.0400   1704122

[497464 rows x 7 columns]